test/fixtures/quaderno_cassettes/unpay_an_invoice.yml

---
http_interactions:
- request:
    method: get
    uri: http://1spyno1mbqbp3SFpg9uT@localhost:3000/recrea/api/v1/invoices.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      authorization:
      - Basic MXNweW5vMW1icWJwM1NGcGc5dVQ6
  response:
    status:
      code: 200
      message: ! 'OK '
    headers:
      x-ratelimit-limit:
      - '2000'
      x-ratelimit-remaining:
      - '1869'
      x-pages-currentpage:
      - '1'
      x-pages-totalpages:
      - '1'
      content-type:
      - application/json; charset=utf-8
      x-ua-compatible:
      - IE=Edge
      etag:
      - ! '"53fc8e14c11dee1f0727271327376f21"'
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 66c63a4a9424a558be6b809b24b544ea
      x-runtime:
      - '0.561372'
      server:
      - WEBrick/1.3.1 (Ruby/1.9.3/2012-04-20)
      date:
      - Tue, 04 Feb 2014 14:52:08 GMT
      content-length:
      - '2818'
      connection:
      - close
    body:
      encoding: US-ASCII
      string: ! '[{"id":3,"number":"0000003","issue_date":"2014-02-04","contact":{"id":2,"full_name":"Another
        Test Contact"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Free
        stuff!","quantity":"200.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":null,"tax_2_name":"","tax_2_rate":null,"reference":"","subtotal":"0.00
        \u20ac","discount":"0.00 \u20ac","gross_amount":"0.00 \u20ac"},{"description":"Pizza
        bagles","quantity":"2.0","unit_price":"15.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":null,"tax_2_name":"","tax_2_rate":null,"reference":"","subtotal":"30.00
        \u20ac","discount":"0.00 \u20ac","gross_amount":"30.00 \u20ac"}],"subtotal":"30.00
        \u20ac","discount":"0.00 \u20ac","taxes":[],"total":"30.00 \u20ac","payments":[{"id":9,"date":"2014-02-04","payment_method":"cash","amount":"100,000,000.00
        \u20ac","url":"http://localhost:3000/recrea/api/v1/invoices/3/payments/9.json"}],"payment_details":"","notes":"","state":"paid","tag_list":[],"permalink":"http://localhost:3000/invoice/060c7204face21de13e68b33c940b030164a42b1","url":"http://localhost:3000/recrea/api/v1/invoices/3.json"},{"id":2,"number":"0000002","issue_date":"2014-02-04","contact":{"id":3,"full_name":"TSM"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Free
        stuff!","quantity":"200.0","unit_price":"1.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":null,"tax_2_name":"","tax_2_rate":null,"reference":"","subtotal":"200.00
        \u20ac","discount":"0.00 \u20ac","gross_amount":"200.00 \u20ac"}],"subtotal":"200.00
        \u20ac","discount":"0.00 \u20ac","taxes":[],"total":"200.00 \u20ac","payments":[],"payment_details":"","notes":"","state":"draft","tag_list":[],"permalink":"http://localhost:3000/invoice/b59479ddd5e9d2ff72d276a1fd9ead4764343984","url":"http://localhost:3000/recrea/api/v1/invoices/2.json"},{"id":1,"number":"0000001","issue_date":"2014-02-04","contact":{"id":1,"full_name":"API
        Test Contact"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Something","quantity":"1.0","unit_price":"10.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":null,"tax_2_name":"","tax_2_rate":null,"reference":"","subtotal":"10.00
        \u20ac","discount":"0.00 \u20ac","gross_amount":"10.00 \u20ac"},{"description":"Free
        stuff!","quantity":"200.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":null,"tax_2_name":"","tax_2_rate":null,"reference":"","subtotal":"0.00
        \u20ac","discount":"0.00 \u20ac","gross_amount":"0.00 \u20ac"}],"subtotal":"10.00
        \u20ac","discount":"0.00 \u20ac","taxes":[],"total":"10.00 \u20ac","payments":[],"payment_details":"","notes":"","state":"draft","tag_list":[],"permalink":"http://localhost:3000/invoice/e8a2610def0bed3cd429f45f9561853d401aa31e","url":"http://localhost:3000/recrea/api/v1/invoices/1.json"}]'
    http_version: '1.1'
  recorded_at: Tue, 04 Feb 2014 14:52:08 GMT
- request:
    method: post
    uri: http://1spyno1mbqbp3SFpg9uT@localhost:3000/recrea/api/v1/invoices/3/payments.json
    body:
      encoding: US-ASCII
      string: payment_method=cash&amount=100000000
    headers:
      authorization:
      - Basic MXNweW5vMW1icWJwM1NGcGc5dVQ6
  response:
    status:
      code: 201
      message: ! 'Created '
    headers:
      x-ratelimit-limit:
      - '2000'
      x-ratelimit-remaining:
      - '1868'
      content-type:
      - application/json; charset=utf-8
      x-ua-compatible:
      - IE=Edge
      etag:
      - ! '"3f28febabe8f01485c497da7125ccf6f"'
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - e9564bb085ba973ea4464bf9230ff244
      x-runtime:
      - '0.161793'
      server:
      - WEBrick/1.3.1 (Ruby/1.9.3/2012-04-20)
      date:
      - Tue, 04 Feb 2014 14:52:08 GMT
      content-length:
      - '158'
      connection:
      - close
      set-cookie:
      - _quaderno_session=BAh7BkkiD3Nlc3Npb25faWQGOgZFRkkiJTczZGU2M2M5OWE0NmI1MzhkNzEwZmVmZmVjMmNiOTJjBjsAVA%3D%3D--e860f98e9cef24ddad053e927991adec208f9b9d;
        path=/; HttpOnly
    body:
      encoding: US-ASCII
      string: ! '{"id":10,"date":"2014-02-04","payment_method":"cash","amount":"100,000,000.00
        \u20ac","url":"http://localhost:3000/recrea/api/v1/invoices/3/payments/10.json"}'
    http_version: '1.1'
  recorded_at: Tue, 04 Feb 2014 14:52:08 GMT
- request:
    method: delete
    uri: http://1spyno1mbqbp3SFpg9uT@localhost:3000/recrea/api/v1/invoices/3/payments/10.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      authorization:
      - Basic MXNweW5vMW1icWJwM1NGcGc5dVQ6
  response:
    status:
      code: 204
      message: ! 'No Content '
    headers:
      x-ratelimit-limit:
      - '2000'
      x-ratelimit-remaining:
      - '1867'
      x-ua-compatible:
      - IE=Edge
      cache-control:
      - no-cache
      x-request-id:
      - 2545ba23b487f76468adb5ef24f85f84
      x-runtime:
      - '0.476464'
      server:
      - WEBrick/1.3.1 (Ruby/1.9.3/2012-04-20)
      date:
      - Tue, 04 Feb 2014 14:52:08 GMT
      connection:
      - close
      set-cookie:
      - _quaderno_session=BAh7BkkiD3Nlc3Npb25faWQGOgZFRkkiJWNkNDBlNjI4MjM4OTYxYmU3ODhjNWU3ZTIwZjc3ZjZkBjsAVA%3D%3D--e9b51fadab222365a22c992455fef52d98fa67f1;
        path=/; HttpOnly
    body:
      encoding: US-ASCII
      string: ''
    http_version: '1.1'
  recorded_at: Tue, 04 Feb 2014 14:52:08 GMT
recorded_with: VCR 2.3.0
